<a href="https://colab.research.google.com/github/hannasss/SOLUX_summer_data/blob/master/2%EC%A3%BC%EC%B0%A8/pandas7.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
student_list =[
    {'name':'John','major':"computer Science",'sex':"male"},
     {'name':'Nate','major':"computer Science",'sex':"male"},
     {'name':'Abraham','major':"Physics",'sex':"male"},
     {'name':'Brian','major':"Psychology",'sex':"male"},
     {'name':'Janny','major':"Economics",'sex':"female"},
     {'name':'Yuna','major':"Economics",'sex':"female"},
     {'name':'Jeniffer','major':"computer Science",'sex':"female"},
     {'name':'Edward','major':"computer Science",'sex':"male"},
     {'name':'Zara','major':"Psychology",'sex':"female"},
     {'name':'Wendy','major':"Economics",'sex':"female"},
     {'name':'Sera','major':"Psychology",'sex':"female"},
]
df = pd.DataFrame(student_list,columns =['name','major','sex'])

In [ ]:
df

        name             major     sex
0       John  computer Science    male
1       Nate  computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  computer Science  female
7     Edward  computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

'major' 를 그룹으로 묶기

In [ ]:
groupby_major =df.groupby('major')

'major'의 갯수세기

In [ ]:
groupby_major.groups

{'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64'),
 'computer Science': Int64Index([0, 1, 6, 7], dtype='int64')}

가독성 쉽게 출력

In [ ]:
for name,group in groupby_major:
    print(name+":"+str(len(group)))
    print(group)
    print()

Economics:3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics:1
      name    major   sex
2  Abraham  Physics  male

Psychology:3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

computer Science:4
       name             major     sex
0      John  computer Science    male
1      Nate  computer Science    male
6  Jeniffer  computer Science  female
7    Edward  computer Science    male

'major'별 몇명있는지 세고 column 으로 출력하기

In [ ]:
df_major_cnt = pd.DataFrame({'count':groupby_major.size()}).reset_index()
df_major_cnt

              major  count
0         Economics      3
1           Physics      1
2        Psychology      3
3  computer Science      4

In [ ]:
groupby_sex =df.groupby('sex')

In [ ]:
for name,group in groupby_sex:
    print(name+":"+str(len(group)))
    print(group)
    print()

female:6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male:5
      name             major   sex
0     John  computer Science  male
1     Nate  computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  computer Science  male